Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/public_transport/duties_of_drivers_of_spsv_in_ire.html.txt.tmx
Source language: en
Languages: ga

source: Duties of drivers of Small Public Service Vehicles (SPSVs)
ga: Dualgais atá ar thiománaithe Feithiclí Beaga Seirbhíse Poiblí (FBSP) in Éirinn

source: The National Transport Authority can make rules regarding the conduct and duties of drivers of taxis and other small public service vehicles
ga: Is féidir leis an tÚdarás Náisiúnta Iompair rialacha a dhéanamh maidir le hiompar agus dualgais tiománaithe tacsaithe agus feithiclí beaga seirbhíse poiblí eile in Éirinn

source: Small public service vehicles include taxis, hackneys and limosuines
ga: Tá tacsaithe, hacnaithe agus limisíní san áireamh i bhfeithiclí beaga seirbhíse poiblí in Éirinn

source: Section 20 of the Taxi Regulation Act 2013 empowers the National Transport Authority to make these rules
ga: Tugtar de chumhacht don tÚdarás Náisiúnta Iompair na rialacha seo a dhéanamh le hAlt 20 den Acht um Rialáil Tacsaithe 2013

source: The following information sets out broadly the duties of drivers of these vehicles
ga: Tugtar breac-chuntas leis an eolas seo a leanas ar na dualgais atá ar thiománaithe na bhfeithiclí seo

source: What are the duties of small public service vehicle drivers?
ga: Cad iad na dualgais atá ar thiománaithe feithiclí beaga seirbhíse poiblí?

source: Information display: Drivers must display their SPSV driver licence number on their badge
ga: Taispeáint faisnéise: Ní mór do thiománaithe a n-uimhir cheadúnas tiomána SPSV a thaispeáint ar a suaitheantas

source: The regulations require all drivers to also have the following information on display:
ga: Ceanglaíonn na rialacháin seo ar gach tiománaí an fhaisnéis a leanas a bheith ar taispeáint acu, chomh maith:

source: • The Driver County Identification and the five digit National Licence Number on the front and back of the roof sign of a taxi
ga: • Aitheantas Contae an Tiománaí agus an Uimhir Náisiúnta Cheadúnais cúig dhigit chun tosaigh agus ar chúl an chomhartha dín ar thacsaí

source: • National Licence Number and expiry date, vehicle registration number and number of passengers the vehicle is licensed to carry (on a tamper proof disc on the front and rear windscreen)
ga: • An Uimhir Náisiúnta Cheadúnais agus an dáta éagtha, uimhir chláraithe na feithicle agus an líon paisinéirí atá an fheithicil ceadúnaithe le hiompar (ar dhiosca dosháraithe ar an ngaothscáth tosaigh agus cúil)

source: • The Driver ID Card on the dashboard inside the vehicle
ga: • Cárta Aitheantais an Tiománaí ar an deais laistigh den fheithicil

source: • Details on the national taxi fare and information on how to make a complaint and report good service (This is displayed in the front passenger area, such as on the sun visor or dashboard)
ga: • Sonraí ar an táille náisiúnta tacsaí agus faisnéis ar conas gearán a dhéanamh agus seirbhís mhaith a thabhairt le fios (taispeántar seo os comhair limistéar an phaisinéara, ar nós an scáthláin ghréine nó ar an deais)

source: • The appropriate Passenger Information Card, which provides useful information for passengers and, in the case of taxis, fare information (This is displayed in the back of the vehicle)
ga: • An Cárta Faisnéise cuí do Phaisinéirí, a chuireann faisnéis áisiúil ar fáil do phaisinéirí agus, i gcás tacsaithe, faisnéis ar tháillí (taispeántar seo ar chúl na feithicle)

source: It is an offence for a driver not to have the required information on display
ga: Is coir é mura bhfuil an fhaisnéis riachtanach ar taispeáint ag tiománaí

source: If found guilty, the driver can be subject to a class C fine
ga: Má chiontaítear tiománaí ina leith seo, d’fhéadfadh sé/sí bheith faoi dhliteanas íoc as fíneáil aicme C

source: Since January 2013, all taxis are required to have branding fitted in order to renew the vehicle licence
ga: Ó Eanáir 2013, tá ar gach tacsaí brandáil a bheith feistithe acu d’fhonn an ceadúnas feithicle a athnuachan

source: The semi-permanent branding is fitted to the driver’s and the front passenger’s doors, and it includes the vehicle licence number
ga: Feistítear an bhrandáil leathbhuan do dhoirse an tiománaí agus an phaisinéara tosaigh, agus áirítear leis uimhir cheadúnais na feithicle

source: Right to refuse a passenger: Drivers have the right to refuse to take a fare from you if you are unable to prove that you can pay the fare
ga: Tá sé de cheart ag tiománaithe diúltú tú a ghlacadh ar bord mura bhfuil tú in ann a chruthú gur féidir leat an táille a íoc

source: They cannot unreasonably refuse to take you up to a distance of 30 kilometres
ga: Ní féidir leo diúltú go míréasúnach tú a thógáil achar nach faide ná 30 ciliméadar

source: They may, however, refuse to take you any further
ga: Féadfaidh siad diúltú tú a thógáil níos faide áfach

source: Taking the shortest route: Under Section 23 of the Taxi Regulation Act 2013, drivers must take the shortest possible route when taking you to your destination
ga: An bealach is giorra a thógáil. Faoi Alt 23 d’Acht um Rialáil Tacsaithe 2013, caithfidh tiománaithe an bealach is giorra is féidir a thógáil agus tú á thabhairt chuig do cheann scríbe acu

source: Fares: Section 23 of the 2013 Act also makes it an offence for an SPVC driver to charge you more than the fare agreed at the start of the journey
ga: Táillí. Déanann Alt 23 den Acht 2013 freisin gur cion é do tiománaí SPVC a ghearradh ort níos mó ná an táille a comhaontaíodh ag tús an turais

source: If found guilty they can be subject to a class C fine
ga: Má fhaightear ciontach féidir leo a bheith faoi réir aicme C fíneáil

source: Under Section 24 of the 2013 Act, a taxi driver found guilty of charging more than the maximum fare shown on the taximeter can be subject to a class B fine
ga: Faoi Alt 24 den Acht 2013, má tá tiománaí tacsaí a fhaightear ciontach mhuirearú níos mó ná an táille uasta a thaispeántar ar an tacsaiméadar, is féidir leo a bheith faoi réir aicme B fíneáil

source: Operation of equipment: Taxi drivers must use a taximeter that has been tested and sealed by the Legal Metrology Service (LMS) to calculate the fare if the journey is within their taximeter area
ga: Trealamh a fheidhmiú. Caithfidh tiománaithe tacsaithe tacsaiméadar a úsáid a bheidh tástáilte agus séalaithe ag an tSeirbhís Mhéadreolaíochta Dlí (SMD) chun an táille a ríomh má bhíonn an turas laistigh dá limistéar tacsaiméadair

source: Drivers must ensure that the meter is in good working order as set out in the Metrology Act 1996
ga: Caithfidh tiománaithe a chinntiú go mbeidh an méadar in ord maith oibre faoi mar a leagtar amach san Acht Méadreolaíochta 1996

source: Since September 2006, taxi drivers have been required to have the national fare structure programmed into their meters
ga: Ceanglaíodh ar thiománaithe tacsaithe an struchtúr táillí náisiúnta bheith ríomhchláraithe ina dtacsaiméadair

source: It is an offence to operate a taxi without the meter being set up to charge accordingly
ga: Tá sé ina chion tacsaí a fheidhmiú gan an méadar a bheith socraithe chun táillí a ghearradh dá réir

source: Issuing of receipts: All taxis are required to issue you with a printed receipt from the taximeter upon payment of the fare
ga: Admhálacha a eisiúint. Ceanglaítear ar gach tacsaí admháil phriontáilte a eisiúint duit ón tacsaiméadar ar íoc na táille duit

source: Hackneys and limousines must also issue you with a receipt (which may be handwritten)
ga: Caithfidh tiománaithe hacnaí agus limisíní admháil a eisiúint duit freisin (a d’fhéadfadh a bheith scríofa de láimh)

source: Accessibility: SPSV drivers are obliged to facilitate passengers who use wheelchairs if they have a wheelchair accessible vehicle and licence
ga: Inrochtaineacht. Tá sé d’oibleagáid ar thiománaithe FBSP freastal ar phaisinéirí a úsáideann cathaoireacha rotha má bhíonn feithicil agus ceadúnas acu lena gceadaítear cathaoireacha rotha a iompar

source: Wheelchair accessible vehicles have to meet the standards set out in the Authority's publication National Vehicle Standards (pdf)
ga: Caithfidh feithiclí atá inrochtana ag cathaoireacha rotha na caighdeáin arna leagan amach i bhfoilseachán an tÚdarás National Vehicle Standards (pdf) a chomhlíonadh

source: Lost Property: SPSV drivers are obliged to hand in any lost property left in their vehicle to An Garda Síochána
ga: Earraí Caillte. Tá sé d’oibleagáid ar thiománaithe FBSP aon earraí caillte a fhágtar ina bhfeithicil a thabhairt ar láimh don Gharda Síochána

source: Compliance with road traffic legislation
ga: Reachtaíocht um thrácht ar bhóithre a chomhlíonadh

source: Drivers of SPSVs in Ireland must comply with Road Traffic legislation as laid out in the various Road Traffic Acts
ga: Caithfidh tiománaithe FBSP in Éirinn an reachtaíocht um Thrácht ar Bhóithre arna leagan amach sna hAchtanna éagsúla um Thrácht ar Bhóithre a chomhlíonadh

source: This means that they are obliged to obey the national road speed limits, wear seatbelts at all times when driving, carry their driving licence with them at all times and ensure that their have adequate and current motor tax and motor insurance
ga: Ciallaíonn sé seo go bhfuil sé d’oibleagáid orthu déanamh de réir na dteorainneacha náisiúnta luais ar bhóithre, criosanna sábhála a chaitheamh ag gach tráth agus iad ag tiomáint, a gceadúnas tiomána a iompar ag gach tráth agus a chinntiú go mbeidh leor-mhótarcháin agus leorárachas mótair reatha acu
